## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_mongo_collection.lagfest will be updated in-place
  ~ resource "azurerm_cosmosdb_mongo_collection" "lagfest" {
        id                     = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.DocumentDB/databaseAccounts/ruut-tf-cosmos-db-39756/mongodbDatabases/main/collections/ruut-lagfest"
        name                   = "ruut-lagfest"
        # (8 unchanged attributes hidden)

      - index {
          - keys   = [
              - "_id",
            ] -> null
          - unique = true -> null
        }
      + index {
          + keys   = [
              + "_id",
            ]
          + unique = false
        }
    }

  # module.function.azurerm_function_app_function.lagfest_signups will be created
  + resource "azurerm_function_app_function" "lagfest_signups" {
      + config_json          = jsonencode(
            {
              + bindings = [
                  + {
                      + authLevel = "anonymous"
                      + direction = "in"
                      + methods   = [
                          + "post",
                        ]
                      + name      = "lagfest-signup"
                      + route     = "lagfest-signup"
                      + type      = "httpTrigger"
                    },
                  + {
                      + direction = "out"
                      + name      = "$return"
                      + type      = "http"
                    },
                ]
            }
        )
      + config_url           = (known after apply)
      + enabled              = true
      + function_app_id      = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.Web/sites/ruut-backend-function-app"
      + id                   = (known after apply)
      + invocation_url       = (known after apply)
      + language             = "Python"
      + name                 = "lagfest-signups-function"
      + script_root_path_url = (known after apply)
      + script_url           = (known after apply)
      + secrets_file_url     = (known after apply)
      + test_data_url        = (known after apply)
      + url                  = (known after apply)

      + file {
          + content = <<-EOT
                import azure.functions as func
                import logging
                import re
                from datetime import datetime, timedelta
                import pytz
                
                TZ = pytz.timezone("Europe/Helsinki")
                signup_start = TZ.localize(datetime(2024, 2, 15, 16))
                
                app = func.FunctionApp()
                func.HttpResponse.mimetype = 'application/json'
                func.HttpResponse.charset = 'utf-8'
                
                
                @app.function_name(name="LagFestSignUp")
                @app.route(route="lagfest-signup")
                def lagfest_signup(req: func.HttpRequest) -> func.HttpResponse:
                    logging.info('Python HTTP trigger function processed a request.')
                    now = datetime.now(tz=TZ)
                
                    if now < signup_start:
                        logging.info('Returned 400 for too early submission')
                        return func.HttpResponse({"message": "Ilmoittautuminen ei ole vielä auki", "retry": True},
                                                 status_code=400)
                
                    data = req.get_json()
                    if not data:
                        logging.info('Returned 400 for no data')
                        return func.HttpResponse({"message": "Et antanut mitään tietoja", "retry": False},
                                                 status_code=400)
                
                    form_fields = [
                        ("name", str),
                        ("email", str),
                        ("yell", str),
                        ("ticket", str),
                        ("gdpr", bool),
                    ]
                
                    s = [
                        field not in data or not isinstance(data[field], type)
                        for (field, type) in form_fields
                    ]
                
                    if not data["gdpr"]:
                        logging.info('Returned 400 for no gdpr agreement')
                        return func.HttpResponse({"message": "Sinun tulee hyäksyä tietojen käsittely GDPRn mukaisesti, jotta voit ilmoittautua.", "retry": True},
                                                 status_code=400)
                
                    if not re.match(r"^.*@student.l(ut|ab).fi$", data["email"], flags=re.I):
                        if now < signup_start + timedelta(hours=1):
                            logging.info('Returned 400 for too early for non student')
                            return func.HttpResponse({"message": 'Voit ilmoittautua vasta tuntia myöhemmin, jos sähköpostisi ei ole muotoa "@student.lut.fi" tai "@student.lab.fi".', "retry": True},
                                                     status_code=400)
                
                    signup = {}
                
                    for field, _ in form_fields:
                        if field in data:
                            signup[field] = data[field]
                
                    signup["time"] = datetime.now(tz=TZ)
                
                    logging.info(f"Successful submission for {data.get('name')}.")
                    return func.HttpResponse({"message": "Kiitos ilmoittautumisestasi!"},
                                             status_code=400)
            EOT
          + name    = "function_app"
        }
      + file {
          + content = <<-EOT
                azure_storage==0.37.0
                pytz==2023.3.post1
            EOT
          + name    = "requirements"
        }
    }

  # module.function.azurerm_linux_function_app.backend will be updated in-place
  ~ resource "azurerm_linux_function_app" "backend" {
        id                                             = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.Web/sites/ruut-backend-function-app"
        name                                           = "ruut-backend-function-app"
        tags                                           = {}
        # (28 unchanged attributes hidden)

      - sticky_settings {
          - app_setting_names       = [
              - "APPINSIGHTS_INSTRUMENTATIONKEY",
              - "APPLICATIONINSIGHTS_CONNECTION_STRING ",
              - "APPINSIGHTS_PROFILERFEATURE_VERSION",
              - "APPINSIGHTS_SNAPSHOTFEATURE_VERSION",
              - "ApplicationInsightsAgent_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsights_BaseExtensions",
              - "DiagnosticServices_EXTENSION_VERSION",
              - "InstrumentationEngine_EXTENSION_VERSION",
              - "SnapshotDebugger_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsights_Mode",
              - "XDT_MicrosoftApplicationInsights_PreemptSdk",
              - "APPLICATIONINSIGHTS_CONFIGURATION_CONTENT",
              - "XDT_MicrosoftApplicationInsightsJava",
              - "XDT_MicrosoftApplicationInsights_NodeJS",
            ] -> null
          - connection_string_names = [] -> null
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>